profile-management/src/main/resources/wsdl/wjSabreSessionCreateRQ.wsdl

<?xml version="1.0" encoding="utf-8"?>
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsd1="http://www.opentravel.org/OTA/2002/11" xmlns:tns="https://wjws-dev.westjet.com" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:ns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.w3.org/2000/09/xmldsig#" xmlns:ns2="http://www.w3.org/1999/xlink" targetNamespace="https://wjws-dev.westjet.com">
	<types>
		<xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema">
			<xsd:import namespace="http://www.opentravel.org/OTA/2002/11" schemaLocation="wjSabreSessionCreateRQRS.xsd"/>
			<xsd:import namespace="http://www.ebxml.org/namespaces/messageHeader" schemaLocation="msg-header-2_0.xsd"/>
			<xsd:import namespace="http://www.w3.org/2000/09/xmldsig#" schemaLocation="xmldsig-core-schema.xsd"/>
			<xsd:import namespace="http://www.w3.org/1999/xlink" schemaLocation="xlink.xsd"/>
			<xsd:import namespace="http://schemas.xmlsoap.org/soap/envelope/" schemaLocation="envelope.xsd"/>
			<xsd:import namespace="http://www.w3.org/XML/1998/namespace" schemaLocation="xml.xsd"/>
			<xsd:import namespace="http://schemas.xmlsoap.org/ws/2002/12/secext" schemaLocation="wsse.xsd"/>
		</xsd:schema>
	</types>
	<message name="GetSessionCreateInput">
		<part name="header" element="eb:MessageHeader"/>
		<part name="header2" element="wsse:Security"/>
		<part name="body" element="xsd1:SessionCreateRQ"/>
	</message>
	<message name="GetSessionCreateOutput">
		<part name="header" element="eb:MessageHeader"/>
		<part name="header2" element="wsse:Security"/>
		<part name="body" element="xsd1:SessionCreateRS"/>
	</message>
	<portType name="wjSabreSessionCreatePortType">
		<operation name="wjSabreSessionCreateRQ">
			<input message="tns:GetSessionCreateInput"/>
			<output message="tns:GetSessionCreateOutput"/>
		</operation>
	</portType>
	<binding name="wjSabreSessionCreateSoapBinding" type="tns:wjSabreSessionCreatePortType">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<operation name="wjSabreSessionCreateRQ">
			<soap:operation soapAction="OTA"/>
			<input>
				<soap:header message="tns:GetSessionCreateInput" part="header" use="literal"/>
				<soap:header message="tns:GetSessionCreateInput" part="header2" use="literal"/>
				<soap:body parts="body" use="literal"/>
			</input>
			<output>
				<soap:header message="tns:GetSessionCreateOutput" part="header" use="literal"/>
				<soap:header message="tns:GetSessionCreateOutput" part="header2" use="literal"/>
				<soap:body parts="body" use="literal"/>
			</output>
		</operation>
	</binding>
	<service name="wjSabreSessionCreateRQService">
		<port name="wjSabreSessionCreatePortType" binding="tns:wjSabreSessionCreateSoapBinding">
			<soap:address location=" http://127.0.0.1:9000/"/>
		</port>
	</service>
</definitions>
