CodenameNightwing/WebServices/WS especificos/Sabre/XMLSabreRQ/SessionCreateRQ.xml

<soapenv:Envelope 
  xmlns:mes="http://www.ebxml.org/namespaces/messageHeader" 
  xmlns:ns="http://www.opentravel.org/OTA/2002/11" 
  xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" 
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header>
    <sec:Security>
      <!--Optional:-->
      <sec:UsernameToken>
        <!--Optional:-->
        <sec:Username>?</sec:Username>
        <!--Optional:-->
        <sec:Password>?</sec:Password>
        <!--0 to 2 repetitions:-->
        <Organization>AR</Organization>
        <!--Optional:-->
        <Domain>AR</Domain>
      </sec:UsernameToken>
    </sec:Security>
    <mes:MessageHeader mes:id="?" mes:version="?">
      <mes:From>
        <!--1 or more repetitions:-->
        <mes:PartyId mes:type="?">?</mes:PartyId>
        <!--Optional:-->
        <mes:Role>?</mes:Role>
      </mes:From>
      <mes:To>
        <!--1 or more repetitions:-->
        <mes:PartyId mes:type="?">?</mes:PartyId>
        <!--Optional:-->
        <mes:Role>?</mes:Role>
      </mes:To>
      <mes:CPAId>AR</mes:CPAId>
      <mes:ConversationId>ARTestSuiteIT</mes:ConversationId>
      <mes:Service mes:type="?">SessionCreateRQ</mes:Service>
      <mes:Action>SessionCreateRQ</mes:Action>
      <mes:MessageData>
        <mes:MessageId>1</mes:MessageId>
        <mes:Timestamp>?</mes:Timestamp>
        <!--Optional:-->
        <mes:RefToMessageId>?</mes:RefToMessageId>
        <!--Optional:-->
        <mes:TimeToLive>?</mes:TimeToLive>
        <!--Optional:-->
        <mes:Timeout>5</mes:Timeout>
      </mes:MessageData>
      <!--Optional:-->
      <mes:DuplicateElimination>?</mes:DuplicateElimination>
      <!--Zero or more repetitions:-->
      <mes:Description xml:lang="?">?</mes:Description>
      <!--You may enter ANY elements at this point-->
    </mes:MessageHeader>
  </soapenv:Header>
  <soapenv:Body>
    <ns:SessionCreateRQ returnContextID="true">
      <ns:POS>
        <ns:Source PseudoCityCode="DSP"/>
      </ns:POS>
    </ns:SessionCreateRQ>
  </soapenv:Body>
</soapenv:Envelope>